Repository: craftersmine/LaunchPad
Catalog: craftersmine.AppLauncher/Strings/*/UserAppEditor.resw
Source language: en_us
Languages: ru_ru

# AdvancedOptions.Header
source: Advanced parameters
ru_ru: Продвинутые параметры

# AppCoverRecommendationsTextBlock.Text
source: Recommended image aspect ratio: 2:3. Recommended image size: 600x900 pixels
ru_ru: Рекомендуемое соотношение сторон: 2:3. Рекомендуемый размер изображения: 600x900 пикселей

# AppCoverTextBlock.Text
source: App cover image
ru_ru: Изображение обложки приложения

# AppExecutableLabel.Text
source: App executable path
ru_ru: Путь к исполняемому файлу приложения

# AppExecutablePathBrowseButton.Content
source: Browse...
ru_ru: Обзор...

# AppExecutablePathTextBox.PlaceholderText
source: e.g. C:\Windows\notepad.exe
ru_ru: Например: C:\Windows\notepad.exe

# AppExecutionInfoHeader.Text
source: App execution information
ru_ru: Информация для запуска приложения

# AppInfoDescriptionLabel.Text
source: App description
ru_ru: Описание приложения

# AppInfoDescriptionTextBox.PlaceholderText
source: (Optional) Enter an app description
ru_ru: (Необязательно) Введите описание приложения

# AppInfoHeader.Text
source: App information
ru_ru: Информация о приложении

# AppInfoNameLabel.Text
source: App name
ru_ru: Название приложения

# AppInfoNameTextBox.PlaceholderText
source: Enter an app name
ru_ru: Введите название приложения

# AppLaunchArgumentsLabel.Text
source: App launch arguments
ru_ru: Параметры запуска приложения

# AppLaunchArgumentsTextBox.PlaceholderText
source: (Optional) Enter a launch arguments
ru_ru: (Необязательно) Введите параметры запуска приложения

# AppWorkingDirectoryBrowseButton.Content
source: Browse...
ru_ru: Обзор...

# AppWorkingDirectoryLabel.Text
source: App working directory
ru_ru: Рабочий каталог приложения

# AppWorkingDirectoryTextBox.PlaceholderText
source: (Optional) Enter an application working directory path
ru_ru: (Необязательно) Введите путь к рабочему каталогу приложения

# CancelButton.Content
source: Cancel
ru_ru: Отмена

# ExecutablePicker_SelectAppButton
source: Select application
ru_ru: Выбрать приложение

# ImagePicker_SelectImageButton
source: Select image
ru_ru: Выбрать изображение

# NewAppDefaultName
source: New app
ru_ru: Новое приложение

# PageHeaderTextBlock_Add
source: Add an app to library
ru_ru: Добавить приложение в библиотеку

# PageHeaderTextBlock_Edit.Text
source: Edit an app
ru_ru: Редактирование приложения

# RunAsAdminCheckBoxText.Text
source: Run application as administrator
ru_ru: Запускать приложение от имени администратора

# SaveButtonText.Text
source: Save Changes
ru_ru: Сохранить изменения

# UnableToFindDirectoryDlg_Content
source: Unable to find directory in specified location. Check if directory exists in that location, fix path to directory or use folder picker and try again.
ru_ru: Не удалось найти каталог по указанному пути. Проверьте, действительно ли данный каталог присутствует по данному пути, его имя и повторите попытку.

# UnableToFindExecutableDlg_Content
source: Unable to find executable in specified location. Check if executable exists in that location, fix path to executable or use executable picker and try again.
ru_ru: Не удалось найти исполняемый файл по указанному пути. Проверьте, действительно ли данный файл присутствует по данному пути, его имя и повторите попытку.

# UnableToFindExecutableOrDirectoryDlg_Title
source: Unable to find specified file or directory
ru_ru: Не удалось найти файл или папку

# UnableToSaveApp_Content
source: Unable to save application list to storage due to unknown reason! Please try again.
ru_ru: Не удалось сохранить список приложений в хранилище из-за непредвиденной ошибки. Попробуйте снова.

# UnableToSaveApp_Title
source: Error while saving data!
ru_ru: Ошибка сохранения данных!

# WorkingDirectoryPicker_SelectDirectoryButton
source: Select working directory
ru_ru: Выбрать рабочий каталог
